{
  "title": "Bibliomancy Torah",
  "description": "A comprehensive collection of Torah passages for bibliomancy, with contextual information and thematic categorization.",
  "passages": [
    {
      "book": "Genesis",
      "chapter": 1,
      "verse": 1,
      "text": "In the beginning God created the heaven and the earth.",
      "context": "The opening verse of the Torah, describing the creation of the universe.",
      "theme": "Creation",
      "commentary": "This verse sets the stage for the entire biblical narrative, emphasizing the power and sovereignty of God.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Genesis",
      "chapter": 9,
      "verse": 13,
      "text": "I do set my bow in the cloud, and it shall be for a token of a covenant between me and the earth.",
      "context": "God's promise to Noah after the flood, symbolized by the rainbow.",
      "theme": "Covenant",
      "commentary": "The rainbow serves as a reminder of God's promise never to flood the earth again.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Genesis",
      "chapter": 50,
      "verse": 20,
      "text": "But as for you, ye thought evil against me; but God meant it unto good, to bring to pass, as it is this day, to save much people alive.",
      "context": "Joseph speaking to his brothers, reflecting on God's providence.",
      "theme": "Providence and Forgiveness",
      "commentary": "This verse highlights the theme of divine providence and the power of forgiveness.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Exodus",
      "chapter": 14,
      "verse": 13,
      "text": "And Moses said unto the people, Fear ye not, stand still, and see the salvation of the LORD, which he will shew to you to day: for the Egyptians whom ye have seen to day, ye shall see them again no more for ever.",
      "context": "Moses reassures the Israelites as they face the Red Sea with the Egyptian army in pursuit.",
      "theme": "Divine Deliverance",
      "commentary": "This verse highlights God's power to save and deliver His people from seemingly impossible situations.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Exodus",
      "chapter": 20,
      "verse": 2,
      "text": "I am the LORD thy God, which have brought thee out of the land of Egypt, out of the house of bondage.",
      "context": "The preamble to the Ten Commandments, establishing God's authority.",
      "theme": "Divine Authority",
      "commentary": "This verse establishes God's authority and the basis for the commandments that follow.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Exodus",
      "chapter": 34,
      "verse": 6,
      "text": "And the LORD passed by before him, and proclaimed, The LORD, The LORD God, merciful and gracious, longsuffering, and abundant in goodness and truth.",
      "context": "God reveals His character to Moses on Mount Sinai.",
      "theme": "Divine Attributes",
      "commentary": "This passage describes key attributes of God, emphasizing His mercy and truth.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Leviticus",
      "chapter": 19,
      "verse": 18,
      "text": "Thou shalt not avenge, nor bear any grudge against the children of thy people, but thou shalt love thy neighbour as thyself: I am the LORD.",
      "context": "A commandment emphasizing ethical behavior and love towards others.",
      "theme": "Ethics and Morality",
      "commentary": "This verse is foundational for the concept of loving one's neighbor, a principle echoed in many religious and ethical systems.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Leviticus",
      "chapter": 25,
      "verse": 10,
      "text": "And ye shall hallow the fiftieth year, and proclaim liberty throughout all the land unto all the inhabitants thereof: it shall be a jubile unto you; and ye shall return every man unto his possession, and ye shall return every man unto his family.",
      "context": "The proclamation of the Year of Jubilee, a time of liberation and restoration.",
      "theme": "Liberty and Restoration",
      "commentary": "The Jubilee year symbolizes freedom and the restoration of community and family ties.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Leviticus",
      "chapter": 26,
      "verse": 12,
      "text": "And I will walk among you, and will be your God, and ye shall be my people.",
      "context": "God's promise of a covenant relationship with Israel.",
      "theme": "Covenant Relationship",
      "commentary": "This passage emphasizes the intimate relationship between God and His people.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Numbers",
      "chapter": 6,
      "verse": 24,
      "text": "The LORD bless thee, and keep thee:",
      "context": "Part of the Priestly Blessing, a benediction given to the Israelites.",
      "theme": "Blessing",
      "commentary": "This blessing is a prayer for divine protection and favor.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Numbers",
      "chapter": 11,
      "verse": 23,
      "text": "And the LORD said unto Moses, Is the LORD'S hand waxed short? thou shalt see now whether my word shall come to pass unto thee or not.",
      "context": "God reassures Moses of His power to provide for the Israelites.",
      "theme": "Divine Power",
      "commentary": "This verse emphasizes God's unlimited power and ability to fulfill His promises.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Numbers",
      "chapter": 23,
      "verse": 19,
      "text": "God is not a man, that he should lie; neither the son of man, that he should repent: hath he said, and shall he not do it? or hath he spoken, and shall he not make it good?",
      "context": "Balaam's oracle affirming God's faithfulness and truthfulness.",
      "theme": "Divine Faithfulness",
      "commentary": "This passage emphasizes the reliability and unchanging nature of God.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Numbers",
      "chapter": 14,
      "verse": 8,
      "text": "If the LORD delight in us, then he will bring us into this land, and give it us; a land which floweth with milk and honey.",
      "context": "Caleb's encouragement to the Israelites to trust in God's promise of the Promised Land.",
      "theme": "Promise and Hope",
      "commentary": "This verse emphasizes trust in God's promises and the hope of a prosperous future.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Deuteronomy",
      "chapter": 6,
      "verse": 4,
      "text": "Hear, O Israel: The LORD our God is one LORD:",
      "context": "The Shema, a central declaration of the Jewish faith.",
      "theme": "Monotheism",
      "commentary": "This verse affirms the oneness of God and is a key tenet of Jewish theology.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Deuteronomy",
      "chapter": 8,
      "verse": 3,
      "text": "And he humbled thee, and suffered thee to hunger, and fed thee with manna, which thou knewest not, neither did thy fathers know; that he might make thee know that man doth not live by bread only, but by every word that proceedeth out of the mouth of the LORD doth man live.",
      "context": "Moses reminds the Israelites of God's provision during their wilderness journey.",
      "theme": "Divine Provision",
      "commentary": "This passage teaches reliance on God's word and provision beyond physical sustenance.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Deuteronomy",
      "chapter": 30,
      "verse": 19,
      "text": "I call heaven and earth to record this day against you, that I have set before you life and death, blessing and cursing: therefore choose life, that both thou and thy seed may live:",
      "context": "Moses' exhortation to the Israelites to choose life by obeying God's commandments.",
      "theme": "Choice and Consequence",
      "commentary": "This verse highlights the importance of choosing obedience to God for life and blessing.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Deuteronomy",
      "chapter": 31,
      "verse": 6,
      "text": "Be strong and of a good courage, fear not, nor be afraid of them: for the LORD thy God, he it is that doth go with thee; he will not fail thee, nor forsake thee.",
      "context": "Moses' encouragement to the Israelites as they prepare to enter the Promised Land.",
      "theme": "Courage and Trust",
      "commentary": "This verse reassures believers of God's constant presence and support.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Genesis",
      "chapter": 22,
      "verse": 2,
      "text": "And he said, Take now thy son, thine only son Isaac, whom thou lovest, and get thee into the land of Moriah; and offer him there for a burnt offering upon one of the mountains which I will tell thee of.",
      "context": "God's command to Abraham to sacrifice his son Isaac, testing his faith.",
      "theme": "Faith and Sacrifice",
      "commentary": "This passage is a profound test of faith, illustrating the depth of Abraham's trust in God.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Exodus",
      "chapter": 15,
      "verse": 2,
      "text": "The LORD is my strength and song, and he is become my salvation: he is my God, and I will prepare him an habitation; my father's God, and I will exalt him.",
      "context": "Part of the Song of Moses after the crossing of the Red Sea.",
      "theme": "Praise and Worship",
      "commentary": "This verse is a declaration of God's strength and salvation, inspiring worship and praise.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Genesis",
      "chapter": 28,
      "verse": 15,
      "text": "And, behold, I am with thee, and will keep thee in all places whither thou goest, and will bring thee again into this land; for I will not leave thee, until I have done that which I have spoken to thee of.",
      "context": "God's promise to Jacob during his dream at Bethel.",
      "theme": "Divine Presence",
      "commentary": "This verse reassures Jacob of God's constant presence and faithfulness to His promises.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Genesis",
      "chapter": 2,
      "verse": 7,
      "text": "And the LORD God formed man of the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul.",
      "context": "The creation of man, highlighting the divine breath of life.",
      "theme": "Creation of Humanity",
      "commentary": "This verse emphasizes the unique creation of humans and the divine breath that gives life.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Genesis",
      "chapter": 12,
      "verse": 3,
      "text": "And I will bless them that bless thee, and curse him that curseth thee: and in thee shall all families of the earth be blessed.",
      "context": "God's promise to Abram, establishing a covenant of blessing.",
      "theme": "Covenant and Blessing",
      "commentary": "This verse highlights the universal blessing promised through Abram's lineage.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Genesis",
      "chapter": 32,
      "verse": 28,
      "text": "And he said, Thy name shall be called no more Jacob, but Israel: for as a prince hast thou power with God and with men, and hast prevailed.",
      "context": "Jacob's name change to Israel after wrestling with God.",
      "theme": "Transformation and Identity",
      "commentary": "This passage marks a significant transformation in Jacob's life, symbolizing his new identity and relationship with God.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Exodus",
      "chapter": 3,
      "verse": 5,
      "text": "And he said, Draw not nigh hither: put off thy shoes from off thy feet, for the place whereon thou standest is holy ground.",
      "context": "God's command to Moses at the burning bush.",
      "theme": "Holiness and Reverence",
      "commentary": "This verse emphasizes the holiness of God's presence and the reverence required in His presence.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Exodus",
      "chapter": 12,
      "verse": 13,
      "text": "And the blood shall be to you for a token upon the houses where ye are: and when I see the blood, I will pass over you, and the plague shall not be upon you to destroy you, when I smite the land of Egypt.",
      "context": "The institution of Passover, marking the protection of the Israelites.",
      "theme": "Protection and Deliverance",
      "commentary": "This verse highlights the significance of the Passover as a symbol of God's protection and deliverance.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Exodus",
      "chapter": 19,
      "verse": 5,
      "text": "Now therefore, if ye will obey my voice indeed, and keep my covenant, then ye shall be a peculiar treasure unto me above all people: for all the earth is mine:",
      "context": "God's covenant with Israel at Mount Sinai.",
      "theme": "Covenant and Obedience",
      "commentary": "This passage emphasizes the special relationship between God and Israel, contingent on their obedience.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Leviticus",
      "chapter": 11,
      "verse": 45,
      "text": "For I am the LORD that bringeth you up out of the land of Egypt, to be your God: ye shall therefore be holy, for I am holy.",
      "context": "A call to holiness based on God's deliverance of Israel from Egypt.",
      "theme": "Holiness",
      "commentary": "This verse connects the concept of holiness with God's redemptive acts and character.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Leviticus",
      "chapter": 20,
      "verse": 26,
      "text": "And ye shall be holy unto me: for I the LORD am holy, and have severed you from other people, that ye should be mine.",
      "context": "God's call for Israel to be set apart as holy.",
      "theme": "Sanctification",
      "commentary": "This passage emphasizes the distinctiveness and sanctification of God's people.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Numbers",
      "chapter": 13,
      "verse": 30,
      "text": "And Caleb stilled the people before Moses, and said, Let us go up at once, and possess it; for we are well able to overcome it.",
      "context": "Caleb's faith in God's promise to give Israel the Promised Land.",
      "theme": "Faith and Courage",
      "commentary": "This verse highlights Caleb's faith and courage in the face of opposition.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Numbers",
      "chapter": 21,
      "verse": 9,
      "text": "And Moses made a serpent of brass, and put it upon a pole, and it came to pass, that if a serpent had bitten any man, when he beheld the serpent of brass, he lived.",
      "context": "The bronze serpent as a means of healing for the Israelites.",
      "theme": "Healing and Salvation",
      "commentary": "This passage symbolizes God's provision for healing and salvation.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Deuteronomy",
      "chapter": 4,
      "verse": 29,
      "text": "But if from thence thou shalt seek the LORD thy God, thou shalt find him, if thou seek him with all thy heart and with all thy soul.",
      "context": "Moses' encouragement to seek God wholeheartedly.",
      "theme": "Seeking God",
      "commentary": "This verse emphasizes the importance of seeking God with sincerity and devotion.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Deuteronomy",
      "chapter": 10,
      "verse": 12,
      "text": "And now, Israel, what doth the LORD thy God require of thee, but to fear the LORD thy God, to walk in all his ways, and to love him, and to serve the LORD thy God with all thy heart and with all thy soul,",
      "context": "Moses outlines the requirements of a faithful relationship with God.",
      "theme": "Faithfulness and Devotion",
      "commentary": "This passage summarizes the core requirements for a relationship with God: fear, love, and service.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Deuteronomy",
      "chapter": 32,
      "verse": 4,
      "text": "He is the Rock, his work is perfect: for all his ways are judgment: a God of truth and without iniquity, just and right is he.",
      "context": "Moses' song praising God's character and justice.",
      "theme": "Divine Justice",
      "commentary": "This verse highlights God's perfection, truth, and justice.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Genesis",
      "chapter": 3,
      "verse": 15,
      "text": "And I will put enmity between thee and the woman, and between thy seed and her seed; it shall bruise thy head, and thou shalt bruise his heel.",
      "context": "God's pronouncement of enmity between the serpent and humanity.",
      "theme": "Conflict and Redemption",
      "commentary": "This verse is often seen as a prophecy of the ultimate victory over evil.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Genesis",
      "chapter": 17,
      "verse": 5,
      "text": "Neither shall thy name any more be called Abram, but thy name shall be Abraham; for a father of many nations have I made thee.",
      "context": "God changes Abram's name to Abraham, signifying his role as a patriarch.",
      "theme": "Identity and Promise",
      "commentary": "This passage marks a significant moment in Abraham's life, symbolizing his new identity and God's promise.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Genesis",
      "chapter": 45,
      "verse": 5,
      "text": "Now therefore be not grieved, nor angry with yourselves, that ye sold me hither: for God did send me before you to preserve life.",
      "context": "Joseph reveals his identity to his brothers and explains God's purpose.",
      "theme": "Providence and Reconciliation",
      "commentary": "This verse highlights Joseph's understanding of God's providence and his willingness to forgive.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Exodus",
      "chapter": 4,
      "verse": 12,
      "text": "Now therefore go, and I will be with thy mouth, and teach thee what thou shalt say.",
      "context": "God's assurance to Moses of divine help in speaking to Pharaoh.",
      "theme": "Divine Guidance",
      "commentary": "This passage emphasizes God's promise to guide and support Moses in his mission.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Exodus",
      "chapter": 16,
      "verse": 4,
      "text": "Then said the LORD unto Moses, Behold, I will rain bread from heaven for you; and the people shall go out and gather a certain rate every day, that I may prove them, whether they will walk in my law, or no.",
      "context": "God provides manna for the Israelites in the wilderness.",
      "theme": "Provision and Testing",
      "commentary": "This verse highlights God's provision and the testing of the Israelites' obedience.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Leviticus",
      "chapter": 16,
      "verse": 30,
      "text": "For on that day shall the priest make an atonement for you, to cleanse you, that ye may be clean from all your sins before the LORD.",
      "context": "The Day of Atonement, a time for cleansing and forgiveness.",
      "theme": "Atonement and Cleansing",
      "commentary": "This passage emphasizes the importance of atonement and the cleansing of sins.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Leviticus",
      "chapter": 19,
      "verse": 2,
      "text": "Speak unto all the congregation of the children of Israel, and say unto them, Ye shall be holy: for I the LORD your God am holy.",
      "context": "God's call for Israel to be holy as He is holy.",
      "theme": "Holiness and Identity",
      "commentary": "This verse underscores the call to holiness as a reflection of God's character.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Numbers",
      "chapter": 9,
      "verse": 15,
      "text": "And on the day that the tabernacle was reared up the cloud covered the tabernacle, namely, the tent of the testimony: and at even there was upon the tabernacle as it were the appearance of fire, until the morning.",
      "context": "The cloud and fire as signs of God's presence with Israel.",
      "theme": "Divine Presence",
      "commentary": "This passage highlights the visible signs of God's presence with His people.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Numbers",
      "chapter": 24,
      "verse": 17,
      "text": "I shall see him, but not now: I shall behold him, but not nigh: there shall come a Star out of Jacob, and a Sceptre shall rise out of Israel, and shall smite the corners of Moab, and destroy all the children of Sheth.",
      "context": "Balaam's prophecy of a future ruler from Israel.",
      "theme": "Prophecy and Kingship",
      "commentary": "This verse is often interpreted as a messianic prophecy, foretelling a future leader from Israel.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Deuteronomy",
      "chapter": 7,
      "verse": 9,
      "text": "Know therefore that the LORD thy God, he is God, the faithful God, which keepeth covenant and mercy with them that love him and keep his commandments to a thousand generations;",
      "context": "Moses emphasizes God's faithfulness and covenant-keeping nature.",
      "theme": "Faithfulness and Covenant",
      "commentary": "This passage highlights God's enduring faithfulness and mercy to those who love Him.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Deuteronomy",
      "chapter": 11,
      "verse": 18,
      "text": "Therefore shall ye lay up these my words in your heart and in your soul, and bind them for a sign upon your hand, that they may be as frontlets between your eyes.",
      "context": "Moses instructs the Israelites to internalize God's commandments.",
      "theme": "Internalization of God's Word",
      "commentary": "This verse emphasizes the importance of keeping God's words close and central in life.",
      "translation": "King James Version",
      "language": "English"
    },
    {
      "book": "Deuteronomy",
      "chapter": 33,
      "verse": 27,
      "text": "The eternal God is thy refuge, and underneath are the everlasting arms: and he shall thrust out the enemy from before thee; and shall say, Destroy them.",
      "context": "Moses' blessing to Israel, emphasizing God's protection.",
      "theme": "Divine Protection",
      "commentary": "This passage highlights God's eternal nature and His protective care for His people.",
      "translation": "King James Version",
      "language": "English"
    }
  ]
}